RhinoInside.Revit API Documentation
ColorConverter.ToColor Method (Color)
 Converts the specified Autodesk.Revit.DB.Color to an equivalent Color.
 Namespace: RhinoInside.Revit.Convert.System.Drawing
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Color ToColor(
	this Autodesk.Revit.DB.Color color
)
@staticmethod
def ToColor(
	color: Autodesk.Revit.DB.Color
) -> Color
Parameters
color
Type: Autodesk.Revit.DB.Color
Revit color to convert.
Return Value
Type: Color
System color that is equivalent to the provided Revit color.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.Color. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToColor(Color) as extension method:
using System.Drawing;
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.System.Drawing;
Color color = revitColor.ToColor();
import clr
clr.AddReference("System.Drawing")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
from System.Drawing import Color
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.System.Drawing
clr.ImportExtensions(RhinoInside.Revit.Convert.System.Drawing)
color = revit_color.ToColor()    # type: Color
 Using ToColor(Color) as static method:
using System.Drawing;
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.System.Drawing;
Color color = ColorConverter.ToColor(revitColor)
import clr
clr.AddReference("System.Drawing")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
clr.AddReference("Eto")
from System.Drawing import Color
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.System.Drawing.ColorConverter as CC
color = CC.ToColor(revit_color)    # type: Color
See Also
Reference
ColorConverter Class
ToColor Overload
RhinoInside.Revit.Convert.System.Drawing Namespace